In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
l = [4, 8, 15, 16, 23, 42]
pd.Series(l)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
type(pd.Series(l))

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [12]:
a =range(0,20,2)

In [8]:
pd.Series(a)

0     0
1     2
2     4
3     6
4     8
5    10
6    12
7    14
8    16
9    18
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [14]:
data = {"Name":["Alice","Bob","claire"],
       "Age":[25,30,27],
       "Gender":["Female","Male","Female"]}

In [15]:
data

{'Name': ['Alice', 'Bob', 'claire'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

In [16]:
df=pd.DataFrame(data)

In [17]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Data Structure refers to the specialized way of organizing, processing, and storing data to apply specific types of functionalities to them. 

Pandas has two main types of Data Structures based on their dependability –

* Series: 1D labeled array
* DataFrame: 2D labeled tabular structure

**Series vs DataFrame**

Let’s summarize the difference between the two structures in a table:

|Pandas Series|Pandas DataFrame|
|---|---|
|One-dimensional|Two-dimensional|
|Homogenous – Series elements must be of the same data type| Heterogenous – DataFrame elements can have different data types.|
|Size-immutable – Once created, the size of a Series object cannot be changed.	|Size-mutable – Elements can be dropped or added in an existing DataFrame.
|

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Some common functions you can use to manipulate data in a Pandas DataFrame are:
   
   1. Read Data
   2. Head & Tail
   3. Shape, Size and Info
   4. isna
   5. Describe
   6. nunique
   7. Value counts
   8. Columns

In [26]:
#To use Shape,Size and Info function 
df2 = pd.read_csv("heart_failure_clinical_records_dataset.csv")

In [27]:
df2

,age,anaemia,creatinine_phosphokinase,diabetes,ejection_fraction,high_blood_pressure,platelets,serum_creatinine,serum_sodium,sex,smoking,time,DEATH_EVENT
0,75.0,0,582,0,20,1,265000.00,1.9,130,1,0,4,1
1,55.0,0,7861,0,38,0,263358.03,1.1,136,1,0,6,1
2,65.0,0,146,0,20,0,162000.00,1.3,129,1,1,7,1
3,50.0,1,111,0,20,0,210000.00,1.9,137,1,0,7,1
4,65.0,1,160,1,20,0,327000.00,2.7,116,0,0,8,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
294,62.0,0,61,1,38,1,155000.00,1.1,143,1,1,270,0
295,55.0,0,1820,0,38,0,270000.00,1.2,139,0,0,271,0
296,45.0,0,2060,1,60,0,742000.00,0.8,138,0,0,278,0
297,45.0,0,2413,0,38,0,140000.00,1.4,140,1,1,280,0
298,50.0,0,196,0,45,0,395000.00,1.6,136,1,1,285,0

In [28]:
df2.shape

(299, 13)

In [29]:
df2.size

3887

In [31]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 299 entries, 0 to 298
Data columns (total 13 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       299 non-null    float64
 1   anaemia                   299 non-null    int64
 2   creatinine_phosphokinase  299 non-null    int64
 3   diabetes                  299 non-null    int64
 4   ejection_fraction         299 non-null    int64
 5   high_blood_pressure       299 non-null    int64
 6   platelets                 299 non-null    float64
 7   serum_creatinine          299 non-null    float64
 8   serum_sodium              299 non-null    int64
 9   sex                       299 non-null    int64
 10  smoking                   299 non-null    int64
 11  time                      299 non-null    int64
 12  DEATH_EVENT               299 non-null    int64
dtypes: float64(3), int64(10)
memory usage: 30.5 KB

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

DataFrames are both value and size-mutable (A Series, by contrast, is only value-mutable, not size-mutable. The length of a Series cannot be changed although the values can be changed).

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [32]:
# Create pandas Series
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

# Combine two series.
df=pd.concat([courses,fees],axis=1)

# It also supports to combine multiple series.
df=pd.concat([courses,fees,discount],axis=1)
print(df)

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000